import 'package:places/domain/sight.dart';

final List mocks = [
  Sight(
      name: 'вулкан Эльбрус (Кавказ)',
      lat: 43.349920,
      lon: 42.445355,
      url: 'https://disk.yandex.ru/i/irc_Ip2X-bo1sg',
      details:
          'Эльбру́с — стратовулкан на Кавказе (5642 метра над уровнем моря) — самая высокая горная вершина России и Европы.',
      type: 'Географический объект'),
  Sight(
      name: 'озеро Байкал (Иркутская область)',
      lat: 53.432853,
      lon: 107.846816,
      url: 'https://disk.yandex.ru/i/c8dhrzwHLeNikA',
      details:
          'Байкал  — озеро тектонического происхождения в южной части Восточной Сибири, самое глубокое озеро на планете, крупнейший природный резервуар пресной воды и самое большое по площади пресноводное озеро на континенте.',
      type: 'Озеро'),
  Sight(
      name: 'ущелье Баксанское (Кавказ)',
      lat: 43.321239,
      lon: 42.717702,
      url: 'https://disk.yandex.ru/i/jKFAWn_gMg4nWw',
      details:
          'Баксанское ущелье хорошо известно всем альпинистам. Именно отсюда начинаются восхождения на легендарный Эльбрус.',
      type: 'Достопримечательность'),
  Sight(
    name: 'озеро Псенодах',
    lat: 44.010337,
    lon: 39.900181,
    url: 'https://disk.yandex.ru/i/Qi9FxgB4bzBHrw',
    details:
        'Уникальный водоем надежно скрыт от глаз в объятьях Фишт-Оштенского массива. Озеро расположено рядом с истоком реки Цице. На величественном плато Лаго-Наки – оно самое крупное',
    type: 'Озеро',
  ),
];
